; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p17---int100n150-m25---int100c150---s553---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level18 level18)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level18 level19)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level18 level20)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level18 level21)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level18 level22)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level18 level23)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level18 level24)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level18 level25)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level18 level26)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level18 level27)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level18 level28)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level18 level29)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level18 level30)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level18 level31)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level18 level32)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level18 level33)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level18 level34)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level18 level35)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level18 level36)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level18 level37)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level18 level38)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level18 level39)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level18 level40)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level18 level41)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level18 level42)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level18 level43)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level18 level44)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level18 level45)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level18 level46)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level18 level47)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level18 level48)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level18 level49)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level18 level50)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level18 level51)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level18 level52)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level18 level53)
(sum level35 level24 level59)
(sum level36 level1 level37)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level18 level54)
(sum level36 level24 level60)
(sum level37 level1 level38)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level18 level55)
(sum level37 level24 level61)
(sum level38 level1 level39)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level18 level56)
(sum level38 level24 level62)
(sum level39 level1 level40)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level18 level57)
(sum level39 level24 level63)
(sum level40 level1 level41)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level18 level58)
(sum level40 level24 level64)
(sum level41 level1 level42)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level18 level59)
(sum level41 level24 level65)
(sum level42 level1 level43)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level18 level60)
(sum level42 level24 level66)
(sum level43 level1 level44)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level18 level61)
(sum level43 level24 level67)
(sum level44 level1 level45)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level18 level62)
(sum level44 level24 level68)
(sum level45 level1 level46)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level18 level63)
(sum level45 level24 level69)
(sum level46 level1 level47)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level18 level64)
(sum level46 level24 level70)
(sum level47 level1 level48)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level18 level65)
(sum level48 level1 level49)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level18 level66)
(sum level49 level1 level50)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level18 level67)
(sum level50 level1 level51)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level18 level68)
(sum level51 level1 level52)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level18 level69)
(sum level52 level1 level53)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level18 level70)
(sum level53 level1 level54)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level54 level1 level55)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level55 level1 level56)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level56 level1 level57)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level13 level69)
(sum level57 level1 level58)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level13 level70)
(sum level58 level1 level59)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level59 level1 level60)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level60 level1 level61)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level61 level1 level62)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level62 level1 level63)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level63 level1 level64)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level64 level1 level65)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level65 level1 level66)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level66 level1 level67)
(sum level66 level4 level70)
(sum level67 level1 level68)
(sum level68 level1 level69)
(sum level69 level1 level70)

(connected l0 l1)
(fuelcost level4 l0 l1)
(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l0 l4)
(fuelcost level24 l0 l4)
(connected l1 l0)
(fuelcost level4 l1 l0)
(connected l1 l2)
(fuelcost level15 l1 l2)
(connected l1 l3)
(fuelcost level18 l1 l3)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l1)
(fuelcost level15 l2 l1)
(connected l2 l3)
(fuelcost level13 l2 l3)
(connected l3 l1)
(fuelcost level18 l3 l1)
(connected l3 l2)
(fuelcost level13 l3 l2)
(connected l3 l4)
(fuelcost level5 l3 l4)
(connected l4 l0)
(fuelcost level24 l4 l0)
(connected l4 l3)
(fuelcost level5 l4 l3)

(at t0 l0)
(fuel t0 level70)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l3)
(at p3 l2)
(at p4 l4)
(at p5 l0)
(at p6 l3)
(at p7 l3)
(at p8 l4)
(at p9 l1)
(at p10 l0)
(at p11 l4)
(at p12 l2)
(at p13 l0)
(at p14 l0)
(at p15 l4)
(at p16 l3)
)

(:goal
(and
(at p0 l1)
(at p1 l3)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l2)
(at p6 l4)
(at p7 l0)
(at p8 l2)
(at p9 l2)
(at p10 l4)
(at p11 l2)
(at p12 l4)
(at p13 l1)
(at p14 l4)
(at p15 l3)
(at p16 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 17
2. (load p14 t0 l0)
   deleted: (at p14 l0)
   added: (in p14 t0)
   goals met: 0 of 17
3. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 0 of 17
4. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 17
5. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 17
6. (drive t0 l0 l2 level69 level1 level70)
   deleted: (at t0 l0) (fuel t0 level70)
   added: (at t0 l2) (fuel t0 level69)
   goals met: 0 of 17
7. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 1 of 17
8. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 1 of 17
9. (load p12 t0 l2)
   deleted: (at p12 l2)
   added: (in p12 t0)
   goals met: 1 of 17
10. (drive t0 l2 l3 level56 level13 level69)
   deleted: (at t0 l2) (fuel t0 level69)
   added: (at t0 l3) (fuel t0 level56)
   goals met: 1 of 17
11. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 1 of 17
12. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 1 of 17
13. (load p16 t0 l3)
   deleted: (at p16 l3)
   added: (in p16 t0)
   goals met: 1 of 17
14. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 1 of 17
15. (drive t0 l3 l4 level51 level5 level56)
   deleted: (at t0 l3) (fuel t0 level56)
   added: (at t0 l4) (fuel t0 level51)
   goals met: 1 of 17
16. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 2 of 17
17. (unload p14 t0 l4)
   deleted: (in p14 t0)
   added: (at p14 l4)
   goals met: 3 of 17
18. (unload p12 t0 l4)
   deleted: (in p12 t0)
   added: (at p12 l4)
   goals met: 4 of 17
19. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 5 of 17
20. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 5 of 17
21. (load p4 t0 l4)
   deleted: (at p4 l4)
   added: (in p4 t0)
   goals met: 5 of 17
22. (load p15 t0 l4)
   deleted: (at p15 l4)
   added: (in p15 t0)
   goals met: 5 of 17
23. (load p11 t0 l4)
   deleted: (at p11 l4)
   added: (in p11 t0)
   goals met: 5 of 17
24. (drive t0 l4 l3 level46 level5 level51)
   deleted: (at t0 l4) (fuel t0 level51)
   added: (at t0 l3) (fuel t0 level46)
   goals met: 5 of 17
25. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 5 of 17
26. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 6 of 17
27. (unload p15 t0 l3)
   deleted: (in p15 t0)
   added: (at p15 l3)
   goals met: 7 of 17
28. (drive t0 l3 l1 level28 level18 level46)
   deleted: (at t0 l3) (fuel t0 level46)
   added: (at t0 l1) (fuel t0 level28)
   goals met: 7 of 17
29. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 7 of 17
30. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 8 of 17
31. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 9 of 17
32. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 10 of 17
33. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 11 of 17
34. (drive t0 l1 l0 level24 level4 level28)
   deleted: (at t0 l1) (fuel t0 level28)
   added: (at t0 l0) (fuel t0 level24)
   goals met: 11 of 17
35. (unload p16 t0 l0)
   deleted: (in p16 t0)
   added: (at p16 l0)
   goals met: 12 of 17
36. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 13 of 17
37. (drive t0 l0 l2 level23 level1 level24)
   deleted: (at t0 l0) (fuel t0 level24)
   added: (at t0 l2) (fuel t0 level23)
   goals met: 13 of 17
38. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 14 of 17
39. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 15 of 17
40. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 16 of 17
41. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 17 of 17
